backend/app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories"
---
    def index
        render json: Category.all.to_json(
            :except => [:created_at, :updated_at])

SELECT "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        category = Category.find(params[:id])