backend/app/controllers/questions_controller.rb

    def index
        questions = Question.all
---
SELECT "questions".* FROM "questions"